import random

# промт такски також написав ШІ а саме Chat GPT
PROMPT_TASKS = [
    "Напиши промпт, який згенерує розповідь про космічну подорож.",
    "Склади промпт, щоб ШІ пояснив шкільний матеріал з алгебри.",
    "Створи промпт, який допоможе знайти помилку в коді програми.",
    "Склади промпт, щоб отримати рецепт смачної веганської пасти.",
    "Створи промпт, щоб AI згенерував мем про школу.",
    "Придумай промпт для створення навчального плану з англійської мови.",
    "Склади промпт, який створить список тем для наукової роботи.",
    "Напиши промпт, щоб згенерувати історію в стилі фентезі про драконів.",
    "Створи промпт, який попросить AI створити план розвитку стартапу.",
    "Склади промпт, який пояснює як працює блокчейн простими словами.",
    "Напиши промпт для генерації вправ для покращення граматики англійської мови.",
    "Створи промпт, який згенерує ідеї для настільної гри.",
    "Придумай промпт, щоб ШІ написав казку для дітей про дружбу.",
    "Склади промпт для створення інтерв’ю з вигаданим персонажем.",
]

PROMPT_TASKS_CODING = [
    "Створи промпт, щоб написати калькулятор у Python.",
    "Придумай промпт для генерації ілюстрації чарівного лісу.",
    "Напиши промпт, який попросить ШІ створити 10 ідей для блогу про ігри.",
    "Напиши промпт для генерації складного логічного завдання.",
    "Напиши промпт для аналізу популярності соціальних мереж серед підлітків.",
    "Створи промпт для генерації короткого мотиваційного звернення."
]

def get_random_task():
    return random.choice(PROMPT_TASKS)

def get_random_task_coding():
    return random.choice(PROMPT_TASKS)